In [2]:
import pandas as pd
import numpy as np

In [3]:
s1 = pd.Series([10, 20, 30, 40])
s1

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
s1.sum()

100

In [5]:
s1.mean()

25.0

In [6]:
s1.mean().dtype

dtype('float64')

In [7]:
s2 = pd.Series(['분식', '쏘니', '길동', '사또'], index=[
               '하나', '둘', '셋', '넷'], name='출석부')
s2

하나    분식
둘     쏘니
셋     길동
넷     사또
Name: 출석부, dtype: object

In [8]:
s2.index

Index(['하나', '둘', '셋', '넷'], dtype='object')

In [9]:
s2.name

'출석부'

In [10]:
s3 = pd.Series({'name': '김분식', 'age': 30, 'gender': 'male', 'job': '분석가'})
s3

name       김분식
age         30
gender    male
job        분석가
dtype: object

In [11]:
dic1 = {'name': '김분식', 'age': 30, 'gender': 'male', 'job': '분석가'}
pd.Series(dic1)

name       김분식
age         30
gender    male
job        분석가
dtype: object

In [12]:
s4 = pd.Series(['국어', '영어', '수학', '과학'])
s4

0    국어
1    영어
2    수학
3    과학
dtype: object

In [13]:
s4[0]

'국어'

In [14]:
s3

name       김분식
age         30
gender    male
job        분석가
dtype: object

In [15]:
s3[3]

'분석가'

In [16]:
s3['gender']

'male'

In [17]:
s4

0    국어
1    영어
2    수학
3    과학
dtype: object

In [18]:
s4[2:]

2    수학
3    과학
dtype: object

In [19]:
s3[2:]

gender    male
job        분석가
dtype: object

In [20]:
s3['gender':]

gender    male
job        분석가
dtype: object

In [21]:
s3 == '분석가'

name      False
age       False
gender    False
job        True
dtype: bool

In [22]:
s3[s3 == '분석가']

job    분석가
dtype: object

In [23]:
pd.DataFrame([10, 20, 30, 40, 50])

    0
0  10
1  20
2  30
3  40
4  50

In [34]:
pd.DataFrame([[10, 20, 30, 40],
              ['철수', '영희', '분식', '은희']])

    0   1   2   3
0  10  20  30  40
1  철수  영희  분식  은희

In [25]:
df1 = pd.DataFrame([[1000, '과자', '2019-12-31', '반품'],
                    [2000, '음료', '2020-03-02', '정상'],
                    [3000, '아이스크림', '2020-02-03', '정상'],
                    [1000, '과자', '2019-12-31', '반품']],
                   columns=['가격', '종류', '판매일자', '반품여부'],)

In [26]:
df1

     가격     종류        판매일자 반품여부
0  1000     과자  2019-12-31   반품
1  2000     음료  2020-03-02   정상
2  3000  아이스크림  2020-02-03   정상
3  1000     과자  2019-12-31   반품

In [27]:
df1['가격']

0    1000
1    2000
2    3000
3    1000
Name: 가격, dtype: int64

In [28]:
df1['종류']

0       과자
1       음료
2    아이스크림
3       과자
Name: 종류, dtype: object

In [29]:
df1['가격'].sum()

7000

In [30]:
df1['가격'].mean()

1750.0

In [31]:
df1['가격']

0    1000
1    2000
2    3000
3    1000
Name: 가격, dtype: int64

In [32]:
df1[['가격']]

     가격
0  1000
1  2000
2  3000
3  1000

In [33]:
df1[['가격', '종류']]

     가격     종류
0  1000     과자
1  2000     음료
2  3000  아이스크림
3  1000     과자